---
kind: other
id: Methods.T:Autodesk.Revit.DB.DoubleArrayIterator
source: html/947fcdb9-da16-d6d2-78c5-266c36e33f41.htm
---
# DoubleArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.